[
  {
    "Titre": "TSP-Pipeline",
    "Client final": "SNCF",
    "Via": "Sopra Steria",
    "DescriptionCourte": "Reprise et industrialisation d’une application centrale de traitement des données télédiagnostic pour la maintenance prédictive des trains SNCF.",
    "Description": "<p>Projet stratégique de la SNCF visant à exploiter les données de télédiagnostic des trains pour la maintenance prédictive.</p><p>J’ai repris un projet existant dans un contexte technique et humain complexe pour le rendre fiable et industrialisé. En tant que <b>lead technique</b>, j’ai accompagné l’architecte dans la définition de l’architecture sur AWS, mis en place les <b>processus techniques</b>, introduit des <b>bonnes pratiques de développement</b> et structuré le <b>pipeline de tests et de déploiement</b>.</p><p>Résultat : passage d’un projet naissant peu testé à un projet <b>robuste, automatisé et en production</b>, utilisé à grande échelle pour la maintenance prédictive des trains.</p>",
    "Durée": "Depuis août 2024",
    "Technologies": ["Java", "Quarkus", "Angular", "AWS", "Terraform", "Kafka", "SQS"],
    "imageFile": "assets/images/projets/tsp-pipeline.jpg",
    "important": true
  },
  {
    "Titre": "Egide",
    "Client final": "EDF",
    "Via": "CGI",
    "DescriptionCourte": "Refonte d’un ancien outil desktop de radioprotection en une application web moderne, déployée sur AWS et accessible aux équipes EDF R&D.",
    "Description": "<p>Refonte complète d’un ancien client lourd utilisé en centrale nucléaire, afin de le rendre accessible via une interface web moderne et intuitive.</p><p>En tant que <b>lead technique</b>, j’ai assuré la <b>responsabilité technique et le développement principal</b> du projet tout en occupant un rôle élargi : <b>analyse métier</b> auprès des utilisateurs, échanges directs avec les équipes en centrale et <b>pilotage technique</b> dans un contexte de forte autonomie.</p><p>J’ai participé à la <b>migration du cœur applicatif</b> vers une architecture moderne (Java 21, Spring Boot, Angular 17, AWS) et encadré une petite équipe de 2 à 3 développeurs. Le projet a abouti à un <b>déploiement d’une version bêta sur AWS</b> avant sa reprise par une nouvelle équipe interne.</p>",
    "Durée": "1 an et 8 mois",
    "Technologies": ["Java 21", "Spring Boot", "JHipster", "Angular 17", "TypeScript", "AWS", "Amazon ECS", "OpenID Connect (OIDC)"],
    "imageFile": "assets/images/projets/egide.jpg",
    "important": true
  },
  {
    "Titre": "Train Connect",
    "Client final": "SNCF",
    "Via": "Sopra-Steria",
    "DescriptionCourte": "Application centrale de communication entre les trains et le système d’information SNCF, assurant la fiabilité et la continuité des échanges de données 24h/24.",
    "Description": "<p>Train Connect est l’application <b>centrale de communication entre les trains et le système d’information SNCF</b>. Véritable colonne vertébrale du réseau, elle traite plusieurs téraoctets de données par jour et doit fonctionner en continu, 24h/24 et 7j/7. Un grand nombre d’applications critiques de la SNCF dépendent directement de son bon fonctionnement.</p><p>En tant que <b>lead technique</b>, j’ai participé à la <b>conception et à la supervision technique</b> de l’application, en collaboration avec plusieurs autres leads. Mon rôle incluait la <b>présentation et la validation des conceptions techniques auprès du client</b>, l’animation des échanges avec les développeurs, la <b>relecture de code</b> et la <b>résolution de problématiques complexes</b>, notamment sur l’intégration de nouveaux protocoles de communication.</p><p>Le projet a conduit à la <b>mise en production réussie des premiers flux Train Connect</b>, remplaçant progressivement l’ancien système. L’équipe, composée d’une <b>vingtaine de développeurs</b>, fonctionnait avec une forte exigence d’industrialisation, de robustesse et de fiabilité.</p>",
    "Durée": "2 ans et 6 mois",
    "Technologies": ["Java 17", "Spring Boot", "Kafka", "MongoDB", "Docker", "Kubernetes", "Jenkins", "AWS", "OpenShift", "GitLab CI"],
    "imageFile": "assets/images/projets/train-connect.jpg",
    "important": true
  },
  {
    "Titre": "Site personnel",
    "Client final": "Maxime Guyaux",
    "Via": null,
    "DescriptionCourte": "Portfolio personnel conçu pour présenter mes projets.",
    "Description": "<p>Site personnel simple et rapide, utilisé comme portfolio.</p><p>Thème clair/sombre et hébergement sur GitHub Pages.</p><p>Il s'agit de la troisième version de ce site web dans la recherche d'une solution simple, durable et économique.</p>",
    "Durée": "Projet continu (évolution permanente)",
    "Technologies": ["Angular", "TypeScript", "CSS", "GitHub Pages"],
    "imageFile": "assets/images/projets/web-perso.jpg"
  },
  {
    "Titre": "Outil d’initialisation de serveurs",
    "Client final": "Flying Kiwi (interne)",
    "Via": null,
    "DescriptionCourte": "Outil interne d’automatisation permettant de déployer rapidement des serveurs standardisés pour les nouveaux clients de la startup.",
    "Description": "<p>Dans le cadre de la croissance de <b>Flying Kiwi</b>, j’ai développé un <b>outil interne d’initialisation de serveurs</b> permettant de déployer rapidement des environnements homogènes pour chaque nouveau client.</p><p>Réalisé seul dans le cadre de mes fonctions d’infrastructure, il automatise la création et la configuration des serveurs à l’aide de <b>Docker</b>, <b>Ansible</b> et de <b>scripts Bash</b>. Ce projet a permis un <b>gain de temps significatif</b>, une <b>standardisation des déploiements</b> et m’a offert l’opportunité d’explorer de nouveaux outils d’automatisation.</p><p>L’outil est toujours utilisé aujourd’hui pour les nouveaux projets de la startup, bien que son usage soit devenu plus ponctuel.</p>",
    "Durée": "3 semaines",
    "Technologies": ["Docker", "Ansible", "Linux", "Bash", "Jenkins"],
    "imageFile": "assets/images/projets/init-serveur.jpg"
  },
  {
    "Titre": "Site de gestion et réservation multi-bars",
    "Client final": "Carry Nation",
    "Via": "Flying Kiwi",
    "DescriptionCourte": "Refonte complète du site de gestion et de réservation multi-bars pour le groupe Carry Nation.",
    "Description": "<p>Projet de refonte globale du système de réservation et de gestion interne de Carry Nation, réunissant en une seule plateforme leurs anciens sites et de nouveaux services.</p><p>Le site permet la gestion des <strong>réservations multi-bars</strong>, <strong>prépaiements</strong>, <strong>bons cadeaux</strong>, <strong>ateliers</strong> et du <strong>livre de bar</strong>, ainsi que le suivi des <strong>no-shows</strong> et la communication automatique par <strong>e-mail et SMS</strong>.</p><p>J’ai assuré la majeure partie du développement, du <strong>front-end</strong> au <strong>back-end</strong>, ainsi que le <strong>design</strong> en collaboration avec le client.</p><p>Le site est <strong>en production depuis plusieurs années</strong> et utilisé quotidiennement par les équipes de Carry Nation, générant des centaines de réservations chaque jour.</p><p>Techniquement, le projet inclut la <strong>gestion de paiements et prépaiements</strong>, la <strong>génération automatique de PDF</strong> (bons cadeaux), l’<strong>envoi garanti d’e-mails via AWS</strong>, l’<strong>envoi de SMS</strong> et la gestion d’une <strong>infrastructure hybride OVH/AWS</strong>.</p>",
    "Durée": "6 mois",
    "Technologies": ["Angular", "TypeScript", "Node.js", "Express", "AWS", "OVH", "MySQL", "CSS"],
    "imageFile": "assets/images/projets/cocktail.jpg"
  },

  {
    "Titre": "Sites web immobiliers pour deux clients internationaux",
    "Client final": "Caribbean Habitats & Bruce International Properties",
    "Via": null,
    "DescriptionCourte": "Sites web de gestion et vente immobilière pour plusieurs propriétés, intégrant recherche de biens, gestion des annonces, similitude des biens, traduction automatisée et génération de PDF.",
    "Description": "<p>Deux sites de gestion et de présentation de biens immobiliers.</p><p>Recherche, gestion des annonces, traduction et génération de PDF.</p>",
    "Durée": "6 mois",
    "Technologies": ["Java", "JHipster", "Angular", "PostgreSQL", "GCP"],
    "imageFile": "assets/images/projets/immobilier.jpg"
  },
  {
    "Titre": "Applications de gestion (confidentiel)",
    "Client final": "Administration publique",
    "Via": "Atos",
    "DescriptionCourte": "Développement et maintenance de deux applications critiques pour un client public national, avec évolution vers une architecture microservices.",
    "Description": "<p>Maintenance et évolutions sur deux applications publiques.</p><p>Participation au développement, modernisation progressive et accompagnement technique.</p>",
    "Durée": "3 ans et 5 mois",
    "Technologies": ["Java", "Spring Data", "Angular", "JavaScript", "PostgreSQL", "JHipster", "Liferay", "SOAP", "Linux", "JMeter", "JProfiler"],
    "imageFile": "assets/images/projets/atos-public.jpg"
  }
]
